 Решение квадратного уравнения
-------------------------------
 Задание:
Написать программу, которое решает квадратное уравнение.
Ввести у пользователя (с клавиатуры) три коэффициента a, b, c и
вывести все решения уравнения (два, одно), "решений нет",
если их нет или "бесконечно много решений", если подходит любое значение x (a = 0, b = 0, c = 0).
Обработать все варианты исходных данных.

Для вычисления квадратного корня используйте функцию **sqrt** из библиотеки:
``` cpp
#include <cmath>
```
Для точности сравнения с нулём используйте константу
``` cpp
const double EPS = 1e-10;
```

Шаблон решения:
``` cpp
// Функция: решение квадратного уравнения
//   a,b,c - коэффициенты уравнения
//   результат функция выводит на экран
void solve_equation(double a, double b, double c) {
  //  ... здесь ваше решение ...
}

int main() {
  // Коэффициенты квадратного уравнения
  double a, b, c;
  cout << "a = ";
  cin >> a;
  cout << "b = ";
  cin >> b;
  cout << "c = ";
  cin >> c;
  cout << endl;

  // Вызов функции решения квадратного уравнения
  solve_equation(a, b, c);

  return 0;
}
```