/// Поменять значения двух переменных местами не используя третьей
/// --------------------------------------------------------------
#include <iostream>

#define SHOW(x) { cout << #x << " = " << (x) << endl; }

using namespace std;

int main()
{
    /// Две переменные целые
    //-->
    int a = 2, b = 325;
    //<--

    /// Можем написать так:
    //-->
    //                  a            b
    a = a ^ b; //      a^b           b
    b = b ^ a; //      a^b         b^(a^b) = b^a^b = a
    a = a ^ b; //(a^b)^a = a^b^a = b    a
    //<--

    /// А можем ещё короче:
    a = 23325;
    b = -2135;
    SHOW(a);
    SHOW(b);
    //-->
    a ^= b ^= a ^= b;
    //<--
    SHOW(a);
    SHOW(b);

    return 0;
}
