/// Две формы записи для инкремента и декремента
/// * Префиксная: ++i --i
/// * Постфиксная: i++ i--
#include <iostream>

#define SHOW(x) { cout << #x << " = " << x << endl; };

using namespace std;

int main() {
  int i = 2;
  i++;
  SHOW(i) // i = 3
  ++i;
  SHOW(i) // i = 4
  /// Постфиксная форма -
  /// сначала используем значение, потом увеличиваем
  //-->
  int j = i++ + i++; // j = 4 + 4, а потом 2 раза увеличили i
  SHOW(i); // i = 8
  SHOW(j); // j = 6
  //<--

  /// Префиксная форма -
  /// сначала увеличиваем i, потом присваиваем j
  //-->
  i = 1;
  j = ++i;
  SHOW(i) // i = 2
  SHOW(j) // j = 2
  //<--

  j = (++------++++++++++i)++;
  j = ++--++--++++++++++i;
  j = ++--++--++++++++++i;
  j = ++--++--++++++++++i;
  j = ++------++++++++++i;
  SHOW(i)
  SHOW(j)
  return 0;
}
